{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/themacfreezie/git/weather_project/tanzania/household_code/logs/wv2_AGSEC2A.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 May 2020, 13:46:06
{txt}
{com}. clear all
{res}{txt}
{com}. 
. **********************************************************************************
. **      TZA 2010 (Wave 2) - Agriculture Section 2A 
. **********************************************************************************
. 
. use "$root/AG_SEC2A", clear
{txt}
{com}. 
. *       looks like a parcel roster, "all plots anyone in your household owned or cultivated during the 2010 long rainy season"
. 
. rename y2_hhid hhid
{res}{txt}
{com}. rename ag2a_04 plotsize_self
{res}{txt}
{com}. rename ag2a_09 plotsize_gps
{res}{txt}
{com}. 
. generate plot_id = hhid + " " + plotnum
{txt}
{com}. isid plot_id
{txt}
{com}. 
. keep hhid plot_id plotsize_self plotsize_gps
{txt}
{com}. 
. *       Prepare for export
. compress
{txt}  (0 bytes saved)

{com}. describe

{txt}Contains data from {res}G:/My Drive/weather_project/household_data/tanzania/wave_2/raw/AG_SEC2A.dta
{txt}  obs:{res}         6,038                          
{txt} vars:{res}             4                          01 May 2014 17:45
{txt} size:{res}       313,976                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:hhid           }{txt}{bind: str16   }{bind:{txt}%-16s     }{space 1}{bind:         }{bind:  }{res}{res}Unique Household Indentifier{p_end}
{p 0 48}{bind:plotsize_self  }{txt}{bind: double  }{bind:{txt}%16.0g    }{space 1}{bind:         }{bind:  }{res}{res}Area (Acres) Farmers Estimate{p_end}
{p 0 48}{bind:plotsize_gps   }{txt}{bind: double  }{bind:{txt}%16.0g    }{space 1}{bind:         }{bind:  }{res}{res}Area (Acres) GPS measurement{p_end}
{p 0 48}{bind:plot_id        }{txt}{bind: str20   }{bind:{txt}%20s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. summarize 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 8}hhid {c |}{res}          0
{txt}plotsize_s~f {c |}{res}      6,038     2.50366    6.225674          0        300
{txt}plotsize_gps {c |}{res}      4,723    2.704931    5.441107          0      99.35
{txt}{space 5}plot_id {c |}{res}          0
{txt}
{com}. sort plot_id
{txt}
{com}. save "$export/AG_SEC2A", replace
{txt}file G:/My Drive/weather_project/household_data/tanzania/wave_2/refined/AG_SEC2A.dta saved

{com}. 
. * close the log
.         log     close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/themacfreezie/git/weather_project/tanzania/household_code/logs/wv2_AGSEC2A.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 2 May 2020, 13:46:07
{txt}{.-}
{smcl}
{txt}{sf}{ul off}